app/serializers/customer_serializer.rb

  def addresses
  	object.addresses.map do |addy|
---
SELECT "addresses".* FROM "addresses" WHERE "addresses"."customer_id" = ?