app/serializers/order_serializer.rb

SELECT "items".* FROM "items" INNER JOIN "order_items" ON "items"."id" = "order_items"."item_id" WHERE "order_items"."order_id" = ?
---
  def items
  	object.items.map do |item|