app/serializers/orders_serializer.rb

SELECT COUNT(*) FROM "items" INNER JOIN "order_items" ON "items"."id" = "order_items"."item_id" WHERE "order_items"."order_id" = ?
---
  def itemCount
  	object.items.size