app/controllers/customers_controller.rb

SELECT "customers".* FROM "customers"
---
  def index
    @customer = Customer.all