app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders"
---
  def index
    @order = Order.all